In [19]:
import sqlite3
from sqlite3 import Error
import pandas as pd
 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print('sqlite3 version: ', sqlite3.version)
    except Error as e:
        print(e)
 
    return conn
 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query10 = """
        SELECT f.facid,
                f.name AS facility,
                (f.guestcost * g.guest_slots + f.membercost * m.member_slots) - (initialoutlay + 3*monthlymaintenance) AS total_revenue
        FROM Facilities AS f
        LEFT JOIN (
            SELECT facid, SUM(slots) AS member_slots
            FROM Bookings
            WHERE memid <> 0
            GROUP BY facid
            ) AS m
        USING (facid)
        LEFT JOIN (
            SELECT facid, SUM(slots) AS guest_slots
            FROM Bookings
            WHERE memid = 0
            GROUP BY facid
            ) AS g
        USING (facid)
        WHERE (f.guestcost * g.guest_slots + f.membercost * m.member_slots) - (initialoutlay + 3*monthlymaintenance) < 1000
        ORDER BY total_revenue DESC
        """
    cur.execute(query10)
 
    rows10 = cur.fetchall()
 
    df10 = pd.DataFrame(rows10)
    print(df10)
    print('\n')
    #for row in rows10:
    #    print(row)

#----------------
    query11 = """
        SELECT m.surname, m.firstname, s.surname AS recommenders_surname, s.firstname AS recommenders_firstname
        FROM Members AS m
        LEFT JOIN (
            SELECT memid, surname, firstname
            FROM Members
            WHERE memid <>0
        ) AS s ON m.recommendedby = s.memid
        WHERE recommendedby <> ' '
        ORDER BY m.surname, m.firstname
    """
    cur.execute(query11)
 
    rows11 = cur.fetchall()
 
    df11 = pd.DataFrame(rows11)
    print(df11)
    print('\n')
    #for row in rows11:
    #    print(row)
        
#-------------------
    query12 = """
        SELECT memid, surname, firstname, facid, facility, COUNT( facility ) as usage_rate
        FROM (
            SELECT b.bookid, b.facid, b.memid, f.name AS facility, m.surname, m.firstname
            FROM Bookings AS b
            LEFT JOIN Members AS m
                USING ( memid )
            LEFT JOIN Facilities AS f
                USING ( facid )
            WHERE memid <>0
        ) AS s
        GROUP BY memid, facility
        ORDER BY memid, facid
    """
    cur.execute(query12)
 
    rows12 = cur.fetchall()
 
    df12 = pd.DataFrame(rows12)
    print(df12)
    print('\n')
    #for row in rows12:
    #    print(row)

#------------
    query13 = """
        SELECT month, facid, facility, COUNT(facility) AS usage_rate
        FROM (
            SELECT f.name as facility, b.facid, strftime('%m', b.starttime) AS month
            FROM Bookings as b
            LEFT JOIN Facilities as f
                USING (facid)
        ) AS s
        GROUP BY month, facility
        ORDER BY month, facid
    """
    cur.execute(query13)
 
    rows13 = cur.fetchall()
    
    df13 = pd.DataFrame(rows13)
    print(df13)
    print('\n')
    #for row in rows13:
    #    print(row)

def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

sqlite3 version:  2.6.0
Query all tasks
   0                1       2
0  3     Table Tennis  -170.0
1  8       Pool Table  -175.0
2  7    Snooker Table  -255.0
3  2  Badminton Court -2243.5


                    0          1         2          3
0               Bader   Florence  Stibbons     Ponder
1               Baker       Anne  Stibbons     Ponder
2               Baker    Timothy   Farrell     Jemima
3              Boothe        Tim    Rownam        Tim
4             Butters     Gerald     Smith     Darren
5              Coplin       Joan     Baker    Timothy
6             Crumpet      Erica     Smith      Tracy
7                Dare      Nancy  Joplette     Janice
8             Farrell      David      None       None
9             Farrell     Jemima      None       None
10              GUEST      GUEST      None       None
11            Genting    Matthew   Butters     Gerald
12               Hunt       John   Purview  Millicent
13              Jones      David  Joplette     Janice
14              Jones    Douglas     Jones      David
15           Joplette     Janice     Smith     Darren
16          Mackenzie       Anna     Smith     Darren
17               Owen    Charles     Smith     Darren
18             Pinker      David   Farrell     Jemima
19            Purview  Millicent     Smith      Tracy
20             Rownam        Tim      None       None
21             Rumney  Henrietta   Genting    Matthew
22             Sarwin  Ramnaresh     Bader   Florence
23              Smith     Darren      None       None
24              Smith     Darren      None       None
25              Smith       Jack     Smith     Darren
26              Smith      Tracy      None       None
27           Stibbons     Ponder     Tracy     Burton
28              Tracy     Burton      None       None
29         Tupperware   Hyacinth      None       None
30  Worthington-Smyth      Henry     Smith      Tracy


      0        1       2  3                4    5
0     1    Smith  Darren  1   Tennis Court 2   19
1     1    Smith  Darren  2  Badminton Court  132
2     1    Smith  Darren  3     Table Tennis   28
3     1    Smith  Darren  4   Massage Room 1   28
4     1    Smith  Darren  6     Squash Court   14
..   ..      ...     ... ..              ...  ...
197  35     Hunt    John  6     Squash Court    1
198  36  Crumpet   Erica  0   Tennis Court 1    1
199  36  Crumpet   Erica  2  Badminton Court    2
200  36  Crumpet   Erica  3     Table Tennis    2
201  36  Crumpet   Erica  4   Massage Room 1    2

[202 rows x 6 columns]


     0  1                2    3
0   07  0   Tennis Court 1   88
1   07  1   Tennis Court 2   68
2   07  2  Badminton Court   56
3   07  3     Table Tennis   51
4   07  4   Massage Room 1  123
5   07  5   Massage Room 2   12
6   07  6     Squash Court   75
7   07  7    Snooker Table   75
8   07  8       Pool Table  110
9   08  0   Tennis Court 1  146
10  08  1   Tennis Court 2  149
11  08  2  Badminton Court  146
12  08  3     Table Tennis  147
13  08  4   Massage Room 1  224
14  08  5   Massage Room 2   40
15  08  6     Squash Court  170
16  08  7    Snooker Table  159
17  08  8       Pool Table  291
18  09  0   Tennis Court 1  174
19  09  1   Tennis Court 2  172
20  09  2  Badminton Court  181
21  09  3     Table Tennis  205
22  09  4   Massage Room 1  282
23  09  5   Massage Room 2   59
24  09  6     Squash Court  195
25  09  7    Snooker Table  210
26  09  8       Pool Table  435